import numpy as np

# створюємо масив з 200 випадкових чисел від -100 до 100
arr = np.random.randint(-100, 101, size=200)

# виводимо початковий масив
print(f"Початковий масив: \n{arr}")

# відфільтруємо додатні числа
positive_numbers = arr[arr > 0]

# замінюємо всі від’ємні значення на нулі
arr[arr < 0] = 0

# обчислюємо середнє значення отриманого масиву
average = arr.mean()

# вивід результатів
print(f"Додатні числа: \n{positive_numbers}")
print(f"Масив після заміни від’ємних на нулі: \n{arr}")
print(f"Середнє значення: \n{average}")